In [1]:
import pickle
import pandas as pd

Abrimos todos los transformers que guardamos cuando hicimos el modelo

In [2]:

# el mejor modelo
with open("../data/mejor_modelo.pkl", "rb") as modelo:
    modelo=pickle.load(modelo)

Nos preparamos para hacer la predicción

In [3]:
df = pd.read_csv("../data/df_test_mod.csv")
df.head()

   carat  cut  color  clarity
0   0.32    4      5        1
1   1.24    3      5        1
2   1.66    3      0        1
3   0.75    3      0        2
4   1.50    0      1        2

In [4]:
final= modelo.predict(df)

In [5]:
df_final=pd.DataFrame(final)

In [6]:
df_final.head()

          0
0  6.161227
1  8.611700
2  9.437939
3  7.798034
4  9.053461

In [7]:
df_final.to_csv('../data/df_final.csv')

In [8]:
len(df_final)

13485

In [9]:
df_final.columns

RangeIndex(start=0, stop=1, step=1)

In [10]:
df_final = df_final.rename(columns={0: 'price'})

In [11]:
df_final

          price
0      6.161227
1      8.611700
2      9.437939
3      7.798034
4      9.053461
...         ...
13480  8.535826
13481  8.341130
13482  6.543611
13483  8.611970
13484  8.007190

[13485 rows x 1 columns]

In [12]:
df_final.columns

Index(['price'], dtype='object')

In [13]:
len(df_final)

13485

In [14]:
range(13485)

range(0, 13485)

In [15]:
df_final['new_col'] = range(13485)

In [16]:
df_final.head()

      price  new_col
0  6.161227        0
1  8.611700        1
2  9.437939        2
3  7.798034        3
4  9.053461        4

In [17]:
df_final['price'], df_final['new_col'] = df_final['new_col'].values, df_final['price'].values

In [18]:
df_final.head()

   price   new_col
0      0  6.161227
1      1  8.611700
2      2  9.437939
3      3  7.798034
4      4  9.053461

In [19]:
df_final = df_final.rename(columns={"price": "id" , "new_col": "price"})

In [20]:
df_final

          id     price
0          0  6.161227
1          1  8.611700
2          2  9.437939
3          3  7.798034
4          4  9.053461
...      ...       ...
13480  13480  8.535826
13481  13481  8.341130
13482  13482  6.543611
13483  13483  8.611970
13484  13484  8.007190

[13485 rows x 2 columns]

In [22]:
df_final.to_csv('../data/df_final.csv',index=False)